Examples/groovyBC/multiRegionHeaterFeedback/system/heater/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        minY
        {
            type            patch;
        }
        minZ
        {
            type            patch;
        }
        maxZ
        {
            type            patch;
        }
    }

    T
    {
        internalField   uniform 300;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 300;
            }
            "heater_to_.*"
            {
                //                type            compressible::turbulentTemperatureCoupledBaffle;
                type            compressible::turbulentTemperatureCoupledBaffleMixed;
                kappa           solidThermo;
                kappaName       none;
                neighbourFieldName T;
                K               solidThermo;
                KName           none;
                value           uniform 300;
            }
            minY
            {
                type            fixedValue;
                value           uniform 500;
            }
        }
    }

    rho
    {
        internalField   uniform 8000;

        boundaryField
        {
            ".*"
            {
                type            calculated;
                value           uniform 8000;
            }
        }
    }

    K
    {
        internalField   uniform 80;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 80;
            }
        }
    }

    cp
    {
        internalField   uniform 450;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 450;
            }
        }
    }
}

// ************************************************************************* //
